"""Общие сообщения для бота.

Они могут использоваться в нескольких обработчиках.
"""

# Первое сообщение, которое видит пользователь.
# TODO: А где вот все эти документики
GREETING = (
    "🌟 Приветик, я YandexGPT!\n\n"
    "Я могу помочь тебе в решении различных задач.\n"
    "Получить советы и делиться своими идеями.\n"
    "Давайте вместе делать этот мир лучше.\n\n"
    "⚙️ Перед тем как начать пользоваться ботом, вы принимаете что всё будет "
    "мило и пушисто.\n"
)

# Как только пользовать проходит регистрацию, можно приступать к работе
START_WORK = (
    "🍓 Добро пожаловать в семью!\n\n"
    "Теперь вы можете начать общение с ботом.\n"
    "Я с радостью выслушаю ваши идеи и проблемы.\n\n"
    "💡 Некоторые полезные команды:\n"
    "/clear: Очистить контекст бота."
)
